{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "batch_input_shape": [null, 100, 100, 3], "activation": "linear", "dtype": "float32", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "padding": "valid", "activity_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "padding": "valid", "activity_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "padding": "valid", "activity_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "units": 64, "use_bias": true, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "units": 2, "use_bias": true, "trainable": true}}]}